---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTraySettings.UseAnnotationScaleForSingleLineFittings
source: html/2d957937-5e6f-f57b-2692-4a9e1066cf3f.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySettings.UseAnnotationScaleForSingleLineFittings Property

Indicates whether use annotation scale for single line fittings or not.

## Syntax (C#)
```csharp
public bool UseAnnotationScaleForSingleLineFittings { get; set; }
```